Информационная_база/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяПродолжительностьОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Информационная_база/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ПродолжительностьОтпуска()
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	ПродолжительностьОтпуска()
КонецПроцедуры


#КонецОбласти



#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда) 
	
	 ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", Новый Структура ("АдресДанных", АдресДанных));
		
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПродолжительностьОтпуска()
	
	ТЧОтпуска = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	ТЧОтпуска.ОбщаяПродолжительностьОтпуска = (НачалоДня(ТЧОтпуска.ДатаОкончания) - НачалоДня(ТЧОтпуска.ДатаНачала)) / (60 * 60 * 24) + 1 ; 
	
	Если ТЧОтпуска.ОбщаяПродолжительностьОтпуска > 28 Тогда
		РазницаДнейОтпуска = ТЧОтпуска.ОбщаяПродолжительностьОтпуска - 28;
	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("У сотрудника %1,превышен лимит отпускных дней на %2", 
					ТЧОтпуска.Сотрудник, РазницаДнейОтпуска);
			Сообщение.Сообщить(); 				
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
		
	ТЧОтпускаСотрудников = Объект.ОтпускаСотрудников.Выгрузить(); 
	АдресДанных = ПоместитьВоВременноеХранилище(ТЧОтпускаСотрудников , УникальныйИдентификатор);    
	
КонецПроцедуры

#КонецОбласти
